{"Aristokatit": "Aristochats (Les)", "Elokuvat": "Films", "Esimerkki": "Exemple", "Hae elokuvien nimet ja julkaisuvuodet ensisijaisesti käänteisessä\njärjestyksessä julkaisuvuoden mukaan,\ntoissijaisesti aakkosjärjestyksessä.": "Sélectionnez les titres des films et leur année de sortie, principalement du plus récent au plus ancien, secondairement par ordre alphabétique.", "Hae elokuvien nimet ja julkaisuvuodet ensisijaisesti käänteisessä järjestyksessä julkaisuvuoden mukaan, toissijaisesti aakkosjärjestyksessä.": "Sélectionnez les titres de films et les années de sortie principalement dans l'ordre décroissant d'année de sortie, secondairement par ordre alphabétique.", "Hae ennen vuotta 1950 julkaistujen elokuvien nimet.": "Sélectionnez les titres des films sortis avant 1950.", "Hae ennen vuotta 1950 tai vuoden 1980 jälkeen julkaistujen elokuvien nimet.": "Sélectionnez les titres de films sortis avant 1950 ou après 1980.", "Hae kaikki eri etunimet.": "Sélectionnez tous les prénoms.", "Hae kaikki eri nimet.": "Sélectionnez tous les noms de famille.", "Hae kaikkien elokuvien nimet aakkosjärjestyksessä.": "Sélectionnez les noms de tous les films, dans l'ordre alphabétique.", "Hae kaikkien elokuvien nimet ja julkaisuvuodet.": "Sélectionnez les titres et les années de sortie de tous les films.", "Hae kaikkien elokuvien nimet käänteisessä aakkosjärjestyksessä.": "Sélectionnez les titres de tous les films dans l'ordre alphabétique inverse.", "Hae kaikkien elokuvien nimet, joita ei ole julkaistu vuonna 1940.": "Sélectionnez les titres des films qui ne sont pas sortis en 1940.", "Hae kaikkien elokuvien nimet.": "Sélectionnez les titres de tous les films.", "Hae kaikkien vuonna 1940 julkaistujen elokuvien nimet.": "Sélectionnez les titres de tous les films sortis en 1940.", "Hae niiden työntekijöiden määrä, joiden palkka on yli 2000.": "Obtenez le nombre d'employé-es dont le salaire est supérieur à 2000.", "Hae suurin työntekijän palkka.": "Obtenez le salaire le plus élevé parmi les employé-es.", "Hae työntekijöiden määrä.": "Obtenez le nombre d'employé-es.", "Hae työntekijöiden yhteispalkka.": "Obtenez la somme des salaires  des employé-es.", "Hae vuosina 1940–1950 julkaistujen elokuvien nimet.": "Sélectionnez les titres des films sortis entre 1940 et 1950.", "Haluttu tulos": "Résultat attendu", "Hiidenpata": "Taram et le Chaudron magique", "Kirjautuminen": "Connectez-vous", "Kysely": "Requête", "Kyselysi on virheellinen": "Votre requête n'est pas valide", "Kyselysi toimii oikein": "Parfait !", "Kyselysi toimii väärin": "Votre requête ne fonctionne pas comme attendu.", "Kyselysi tulos": "Résultat obtenu", "Lumikki": "Blanche-Neige", "Lähetä vastau": "Envoyer", "Lähetä vastaus": "Envoyer", "Nimet": "Titres", "Näytä mallivastaus": "Afficher un exemple de réponse", "Olet ratkonut": "Réponse correcte", "Tarkasta": "Vérifier", "Taulut": "Tables", "Tehtävä": "Exercice", "Tehtävän valinta": "Exercices", "Tehtävää": "Exercice", "Testi": "Vérification", "Tuhkimo": "Cendrillon", "Tunnus tai salasana ei ole oikea": "Le nom d'utilisateur ou le mot de passe n'est pas correct", "Tyontekijat": "Salariés", "Virhe tehtävän määrittelyssä": "[Erreur dans la définition de l'exercice]", "etunimi": "prénom", "nimi": "titre", "palkka": "salaire", "sukunimi": "nom", "taulu on tyhjä": "La table est vide", "tehtävää": "exercice", "vuosi": "année", "väärin": "erreur", "oikein": "ok", "Hae eri yritysten määrä.": "Recherchez combien il y a d’entreprises différentes.", "yritys": "société", "Muodosta tuloslista, jossa näkyvät kaikki tulokset.": "Créez la liste des scores.", "Pelaajat": "Joueurs", "Tulokset": "Scores", "pelaaja_id": "joueur_id", "tulos": "score", "Hae jokaisesta yrityksestä suurin työntekijän palkka.": "Recherchez le salaire le plus élevé de chaque entreprise.", "Hae jokaisen yrityksen työntekijöiden määrä.": "Obtenez le nombre d'employé-es de chaque entreprise.", "Näytä suurin työntekijän palkka yrityksistä, joissa se on ainakin 5000.": "Afficher le salaire le plus élevé parmi les entreprises où il est d'au moins 5000.", "Ilmoita jokaisesta pelaajasta, mikä on hänen paras tuloksensa.\nVoit olettaa, että jokaisella pelaajalla on ainakin yksi tulos.": "Pour chaque joueur-euse, retrouvez son meilleur score. Vous pouvez supposer que chaque joueur-euse a au moins un résultat. ", "Ilmoita jokaisesta pelaajasta, montako tulosta hänellä on.\nVoit olettaa, että jokaisella pelaajalla on ainakin yksi tulos.": "Pour chaque joueur-euse, indiquez combien de résultats il ou elle a obtenu. Vous pouvez supposer que chaque joueur-euse a au moins un résultat.", "Muodosta tuloslista, jossa näkyy kaikki tulokset järjestettynä ensisijaisesti\nkäänteisesti pistemäärän mukaan ja toissijaisesti nimen mukaan.": "Créez la liste des noms et scores, classés principalement par score décroissant et secondairement dans l'ordre alphabétique des noms.", "Muodosta tuloslista, jossa näkyvät tulokset, jotka ovat parempia kuin 250.": "Créez une liste de résultats affichant les scores supérieurs à 250", "Muodosta tuloslista, jossa näkyvät Uolevin tulokset.": "Créez la liste des scores d'Uolevi.", "nimi2": "nom", "Nimet2": "Noms", "Hae kaikista suorituksista opiskelijan nimi, kurssin nimi ja arvosana.": "Obtenez le nom, la matière et le grade des l'étudiants pour tous les devoirs.", "Hae kaikista Uolevin suorituksista kurssin nimi ja arvosana.": "Trouvez le nom et le grade obtenu dans chaque matière par l'élève nommé Uolevi.", "Hae kaikista Ohpen suorituksista opiskelijan nimi ja arvosana.": "Trouvez le nom et le grade de chaque résultat dans la matière «Ohpe»", "Hae kaikki suoritukset, joissa arvosana on 4 tai 5.": "Obtenez tous les résultats comportant un grade 4 ou 5.", "Hae jokaisesta opiskelijasta suoritusten määrä. Voit olettaa, että jokaisella opiskelijalla on ainakin yksi suoritus.": "Obtenez le nombre de devoirs de chaque étudiant-e. vous pouvez supposer que chacun-e en a au moins un.", "Hae jokaisesta opiskelijasta paras suorituksen arvosana. Voit olettaa, että jokaisella opiskelijalla on ainakin yksi suoritus.": "Obtenez la meilleure note de chque étudiant-e. Vous pouvez supposer que chaun-e a au moins une note.", "Hae tiedot kaikista lentoyhteyksistä.": "Faites la liste de toutes les liaisons existantes.", "Hae kohteet kaikista lennoista, jotka lähtevät Helsingistä.": "Recherchez les destinations de tous les vols au départ d'Helsinki.", "Ilmoita jokaisesta pelaajasta, montako tulosta hänellä on (myös vaikka ei olisi tuloksia).": "Pour chaque joueur-euse, obtenez le nombre de résultats obtenus (même s'il n'y en a pas).", "Hae jokaisesta opiskelijasta suoritusten määrä (myös vaikka ei olisi suorituksia).": "Obtenez le nombre de notes de chaque étudiant-e (même s'il n'y en a pas).", "Hae jokaisesta kurssista suorittajien määrä (myös vaikka ei olisi suorituksia).": "Obtenez le nombre d'étudiants ayant achevé un cours (éventuellement zéro).", "Hae nimet kaikista kursseista, joita on suoritettu ainakin kerran.": "Trouvez les intitulés des cours qui ont été achevés au moins une fois.", "Hae nimet kaikista kursseista, joita ei ole suoritettu kertaakaan.": "Retrouvez les intitulés des cours qui n'ont jamais été achevés.", "Hae jokaisesta kaupungista, montako lentoa sieltä lähtee (myös vaikka ei olisi lentoja).": "Par chaque ville, obtenez le nombre de vols au départ de celle-ci (éventuellement aucun).", "Hae jokaisen tuotteen hinta kaksinkertaisena.": "Obtenez le double du prix de chaque produit.", "Hae kaikki tuotteet, joiden hinta on parillinen.": "Obtenez tous les produits dont le prix est un nombre pair.", "Hae jokaisen sanan pituus merkkeinä.": "Donnez le nombre de caractères de chaque mot.", "Hae kaikki sanat, joiden pituus on alle 6 merkkiä.": "Obtenez tous les mots ayant moins de 6 caractères.", "Hae sanat järjestettynä ensisijaisesti pituuden mukaan ja toissijaisesti aakkosjärjestyksen mukaan.": "Obtenez la liste des mots classés en priorité par longueur croissante puis dans l'ordre alphabétique.", "Hae käyttäjien koko nimet yhtenä sarakkeena.": "Obtenez le nom complet de chaque utilisateur-rice dans une seule colonne.", "Hae kaikkien sanojen yhteispituus.": "Claculez la somme des longueurs de tous les mots.", "Laske jokaisen tilauksen yhteishinta.": "Calculez le montant total de chaque commande.", "Laske kaikkien tilausten yhteishintojen summa.": "Calculate the sum of the total prices of all orders.", "Hae kaikkien elokuvien nimet, jotka on julkaistu karkausvuonna. (Vuosi on karkausvuosi, jos se on jaollinen 4:llä. Jos vuosi on jaollinen 100:lla, se on karkausvuosi vain, jos se on myös jaollinen 400:lla.)": "Donnez les titres des films sortis une année bissextile. (Une année est bissextile si elle est divisible par 4. Mais si elle est divisible par 100 elle n'est déclarée bissextile que si elle est aussi divisible par 400.)", "Hae kaikki tuotteet, joiden hinta on halvin hinta.": "Obtenez tous les produits ayant le prix le plus bas.", "Hae kaikki tuotteet, joiden hinta on enintään kaksinkertainen halvimpaan hintaan verrattuna.": "Cherchez tous les produits dont le prix n'excède pas le double du prix le plus bas.", "Hae kaikki tuotteet, joiden hintaa ei ole millään muulla tuotteella.": "Cherchez les produits dont le prix n'est identique à aucun autre.", "Hae aakkosjärjestyksessä ensimmäinen sana.": "Trouvez le premier mot dans l'ordre alphabétique.", "Hae aakkosjärjestyksessä toinen sana. Voit olettaa, että taulussa ei ole kahta samaa sanaa.": "Search for another word in alphabetical order. You can assume that no two words are the same on the board.", "Hae kaikki sanat paitsi aakkosjärjestyksessä ensimmäinen. Voit olettaa, että taulussa ei ole kahta samaa sanaa.": "Obtenez tous les mots sauf celui qui est le premier de l'ordre alphabétique. Vous pouvez supposer que tous les mots sont différents.", "Hae kaikki sanat, joissa esiintyy i-kirjain.": "Trouvez tous les mots qui contiennent la lettre <pre>i</pre>", "Hae kaikki sanat, jotka alkavat a-kirjaimella.": "Trouvez tous les mots qui commencent par la lettre <pre>a</pre>.", "Hae kaikki sanat, joissa on tasan viisi kirjainta ja toinen kirjain on p.": "Trouvez tous les mots ayant 5 lettres et dont la 2e est un <pre>p</pre>Find all words with exactly five letters and the second letter is p.", "Hae kaikki sanat, joissa on tasan kaksi a-kirjainta.": "Trouvez tous les mots ayant deux lettres <pre>a</pre>.", "Hae jokaisesta käyttäjästä tieto, monessako ryhmässä hän on.": "Obtenez les informations sur le nombre de groupes auxquels appartient chaque utilisateur-rice.", "Hae jokaisesta ryhmästä tieto, montako käyttäjää siihen kuuluu.": "Obtenez pour chaque groupe le nombre d'utilisateur-trices lui appartenant..", "Hae kaikki käyttäjät, jotka kuuluvat yli yhteen ryhmään.": "Trouvez les utilisateur-trices qui appartiennent à un ou plusieurs groupes.", "Hae kaikki käyttäjät, jotka kuuluvat ainakin yhteen samaan ryhmään käyttäjän uolevi kanssa.": "Cherchez tous les utilisateur-trices ayant au moins un groupe en commun avec l'utilisateur <pre>uolevi</pre>.", "Hae kaikki käyttäjät, jotka eivät kuulu mihinkään samaan ryhmään käyttäjän uolevi kanssa.": "Cherchez les utilisateur-trices n'ayant aucun groupe en commun avec l'utilisateur <pre>uolevi</pre>.", "Hae sanat järjestettynä niin, että kirjainkoolla ei ole merkitystä. Jokainen sana muodostuu kirjaimista a–z ja A–Z.": "Obtenez les liste des mots dans l'ordre alphabétique insensible à la casse. Vous pouvez supposer que les mots sont formés des lettres <pre>a-zA-Z</pre>.", "Hae tuote, jonka hinta on halvin (jos halvimpia tuotteita on useita, valitse aakkosjärjestyksessä ensimmäinen).": "Trouvez les produits ayant le plus bas prix (s'il y a des ex-æquo, les mettre dans l'ordre alphabétique).", "Hae jokaisesta tuotteesta tieto, monenko tuotteen hinta eroaa enintään yhdellä (tässä lasketaan mukaan myös tuote itse).": "En prenant chque produit comme référence, indiquez combien il existe de produits dont le prix est différent d'au plus 1 € (y compris le prdouit de référence lui-même).", "Laske, monellako tavalla voit valita kaksi tuotetta niin, että yhteishinta on tasan 10. <br><br> Huom! Yhdistelmässä voi olla kaksi samaa tuotetta ja halutaan laskea erilaiset yhdistelmät. Esimerkissä yhdistelmät ovat selleri+selleri ja lanttu+nauris (eli nauris+lanttu ei ole mukana).": "Calculez de combien de façons on peut choisir deux produits de manière à former un prix total de 10 €.", "Laske, mikä on pienin ero kahden tuotteen hinnassa.": "Calculez la plus petite différence de prix existant entre deux produits.", "Laske jokaisen tilin saldo tapahtumien perusteella (jokaisen tilin saldo on aluksi 0).": "Calculez le solde de chaque compte à partir des transactions (chaque compte est supposé être initialement à 0).", "Laske, monellako tavalla voit valita kaksi tuotetta niin, että yhteishinta on tasan 10. <br><br> Huom! Yhdistelmässä voi olla kaksi samaa tuotetta ja halutaan laskea erilaiset yhdistelmät.\nEsimerkissä yhdistelmät ovat selleri+selleri ja lanttu+nauris (eli nauris+lanttu ei ole mukana).": null, "Opiskelijat": "Etudiants", "Kurssit": "Matières", "Suoritukset": "Résultats", "opiskelija_id": "etudiant_id", "kurssi_id": "matiere_id", "arvosana": "grade", "Tilaukset": "Commandes", "tuote": "produit", "hinta": "prix", "maara": "?note?", "Kaupungit": "Villes", "Lennot": "Vols", "mista_id": "depart_id", "minne_id": "arrivee_id", "Tuotteet": "Produits", "Sanat": "Mots", "sana": "mot", "Kayttajat": "Utilisateurs", "Hae jokaisen tuotteen {{hinta": null, "Hae kaikki tuotteet, joiden {{hinta": null}