{"Hae elokuvien nimet ja julkaisuvuodet ensisijaisesti käänteisessä järjestyksessä julkaisuvuoden mukaan, toissijaisesti aakkosjärjestyksessä.": "Sélectionnez les titres de films et les années de sortie principalement dans l'ordre décroissant d'année de sortie, secondairement par ordre alphabétique.", "Tehtävä": "Tâche", "Esimerkki": "Exemple", "Lähetä vastaus": "Envoyer", "Kysely": "Requête", "Tarkasta": "Vérifier", "Lumikki": "Blanche-Neige", "Aristokatit": "Les Aristochats", "Hae vuosina 1940–1950 julkaistujen elokuvien nimet.": "Sélectionnez les titres des films sortis entre 1940 et 1950.", "Hae kaikkien elokuvien nimet aakkosjärjestyksessä.": "Sélectionnez les noms de tous les films, dans l'ordre alphabétique.", "vuosi": "année", "Elokuvat": "Films", "Hae kaikkien elokuvien nimet.": "Sélectionnez les titres de tous les films.", "Hae kaikkien vuonna 1940 julkaistujen elokuvien nimet.": "Sélectionnez les titres de tous les films sortis en 1940.", "Hiidenpata": "Taram et le Chaudron magique", "Tuhkimo": "Cendrillon", "Hae ennen vuotta 1950 julkaistujen elokuvien nimet.": "Sélectionnez les titres des films sortis avant 1950.", "Hae kaikkien elokuvien nimet, joita ei ole julkaistu vuonna 1940.": "Sélectionnez les titres des films qui ne sont pas sortis en 1940.", "Hae kaikkien elokuvien nimet ja julkaisuvuodet.": "Sélectionnez les titres et les années de sortie de tous les films.", "Hae elokuvien nimet ja julkaisuvuodet ensisijaisesti käänteisessä\njärjestyksessä julkaisuvuoden mukaan,\ntoissijaisesti aakkosjärjestyksessä.": "Sélectionnez les titres des films et leur année de sortie, principalement dans l'ordre d'année croissante, secondairement par ordre alphabétique.", "nimi": "titre", "Hae ennen vuotta 1950 tai vuoden 1980 jälkeen julkaistujen elokuvien nimet.": "Sélectionnez les titres de films sortis avant 1950 ou après 1980.", "Hae kaikkien elokuvien nimet käänteisessä aakkosjärjestyksessä.": "Sélectionnez les titres de tous les films dans l'ordre alphabétique inverse.", "Hae työntekijöiden yhteispalkka.": null, "Tyontekijat": null, "palkka": null, "Hae kaikki eri etunimet.": null, "Nimet": null, "etunimi": null, "sukunimi": null, "Hae kaikki eri nimet.": null, "Hae suurin työntekijän {palkka": null, "Hae niiden työntekijöiden määrä, joiden palkka on yli 2000.": null, "Hae työntekijöiden määrä.": null}